/* NineAnimatorError DecodeError Message: This message is shown with the DecodeError error alert. The parameter inside the parenthesis is an identifier of the value that failed to be decoded. A DecodeError means that NineAnimator failed to deserialize or interpret a previously encoded data. */
"A required value (%@) cannot be read" = "无法读取一个重要的值 (%@)";

/* NineAnimatorError DecodeError Message: This message is shown with the DecodeError error alert. A DecodeError means that NineAnimator failed to deserialize or interpret a previously encoded data. */
"A required value cannot be read" = "无法读取一个重要的值";

/* NineAnimatorError AuthenticationRequiredError Message: Representing an error which NineAnimator cannot continute until an authentication action is performed. */
"An authentication is required before NineAnimator can continue" = "在 NineAnimator 继续进行之前您需要进行身份验证";

/* NineAnimatorError ProviderError Message: This error message is shown when NineAnimator failed to fetch a resource on a streaming server. */
"NineAnimator cannot fetch a resource on the streaming server" = "NineAnimator 无法在流媒体服务器上获取资源";

/* NineAnimatorError ResponseError Message: This error message is shown when NineAnimator cannot understand a response sent by the server. */
"NineAnimator cannot understand a response sent by the server" = "NineAnimator 无法理解服务器发送的回复";

/* NineAnimatorError AuthenticationRequiredError Recovery Option: This text is shown on the Open Link button of an alert that prompts the user to solve an CAPTCHA manually. */
"Open Link" = "打开链接";

/* NineAnimatorError SearchError Message: A search error represents a non-fatal error thrown by the Source when searching. */
"Search Completed" = "搜索完成";

/* NineAnimatorError LastItemInQueueError Message: This message is shown when the user has reached the last item in the list. */
"There are no more items in the selected list" = "所选列表中没有更多项目";

/* NineAnimatorError URLError Message: This error message is shown when an URL is malformed, broken, or unexpected. */
"There is something wrong with the url" = "URL 有错误";

/* NineAnimatorError ContentUnavailableError Message: This error is shown when the content that the user is requesting is no longer available. */
"This content is no longer available" = "抱歉，这个资源已经不存在了";

/* NineAnimatorError EpisodeServerNotAvailableError Message: This error message is shown to the user when an episode selected is not available on the selected server. The parameter is the name of the server that is selected by the user. */
"This episode is not available on %@" = "此剧集在 %@ 上不存在";

/* NineAnimatorError EpisodeServerNotAvailableError Message: This error message is shown to the user when an episode selected is not available on the selected server. */
"This episode is not available on the selected server" = "此剧集在所选服务器上不可用";

/* NineAnimatorError CloudflareAuthenticationChallenge Message: This message is shown when a website that uses Cloudflare is requesting additional WAF (Web Application Firewall) verifications. This can typically be handled internally by NineAnimator, but if NineAnimator failed to resolve the challenges this error message will be presented to the user. */
"this website asks NineAnimator to verify the identity of the user" = "此网站请求 NineAnimator 验证您的身份";

/* NineAnimatorError UnknownError Message: This error message is shown when an unknown error had occurred internally. */
"Unknown reason" = "未知原因";

/* NineAnimatorError AuthenticationRequiredError Recovery Suggestion: This message is shown when an AuthenticationRequiredError happens to be resolvable manually (ex. a CAPTCHA request). */
"You may perform the authentication with the opening link, after which NineAnimator may re-attempt the request." = "您可以使用 打开链接 进行身份验证，然后 NineAnimator 将会重新尝试请求。";
